[
  {
    "id": "6-adventurous-day-hikes-near-vancouver",
    "content": [
      "We’ve seen lots of lists of hikes close to Vancouver that name the usual suspects (the Grind, the Chief, Lynn Valley Loop, etc…). But, we wanted to take a look at some of the hikes close to Vancouver that are actually exciting, adventurous and typically not packed with tons of people.",
      "1. Crown Mountain",
      "If you’re really adventurous, and your legs are really in shape, you could try to hike the Grouse Grind and then conquer Crown Mountain, but you should start early. Otherwise, take the gondola up and begin your hike from there. Crown Mountain is a bit of a grunt hike. You start out walking around the usual top-of-Grouse hikes and then going down into a valley, before actually beginning your ascent up to the Crown. It’s steep, it’s got a lot of rock scrambles that you have to get over, and if you’re afraid of heights, you may shit your pants a little bit. But, it’s fun! The view from the top is astounding and if you can actually make it to the very, very top, you will be amazed at the valley views below.",
      "2. Hanes Valley Trail",
      "If you want to experience a variety of North Vancouver’s wildlife and fauna, you’ve got to try the Hanes Valley Trail. This difficult and lengthy trail gets you started in Lynn Valley and takes you all the way to the top of Grouse Mountain (for some well-deserved nachos). This hike is not for the lazy tourist and its notorious for requiring North Shore Rescue to come to the aid of ill-prepared hikers. If you do take up the challenge, you’ll be rewarded with amazing scenery, waterfalls, mushrooms, drawstring bridges, and a scrambly rock face that’ll get you huffing and puffing. If you’re feeling especially good at the end, you can even save yourself $10 and walk down the BCMC trail instead of taking the gondola down.",
      "3. The Lions",
      "You can’t call yourself a Vancouver local until you’ve stood on top of a Lion and yodeled down to the city below you. Okay, that’s not true, but it sure feels good to make it to the top of The Lions, a mountain that is iconic in Vancouver. The trail to the Lions is full of switchbacks and forests and snow and quite a few people. A part of the Howe Sound Crest Trail (also an awesome journey if you want to do a multiple-day hike), the Lions Binkert trail is a fun, yet difficult trail. Bring a lunch for the top and spend an hour or so taking in the Lower Mainland from a different viewpoint.",
      "4. Wedgemont Lake",
      "There are plenty of hikes along the Sea to Sky highway that are worth a visit, but Wedgemount Lake is one of the most interesting ones. Try and do it in a day if you’re feeling especially adventurous. The trailhead is just outside of Whistler on the way to Pemberton, so leave early. The hike itself is not too bad until you get to the upper reaches. Flies and scrambly rocks and trees and lots of time to reflect with yourself in silence as to what you are doing with your life. The top of the hike is the prize, with an absolutely stunning blue glacier lake that you can camp at or just take a quick dip in. If you have time, you can hike onto the snow glacier, but may be tough on your already tired legs.",
      "5. Hike in the Dark to see the sunrise",
      "If you’re feeling especially adventurous, why not try tackling your favourite Vancouver hike in the dark? All you need is a headlamp, a partner or two, and nerves of steel. Hiking in the dark is incredibly different from the usual grind up a mountain, because every little noise and crack will have your imagination running wild. Is that shadow over there a stump or a bear? Did I just hear a mountain lion roar? If you’re up for the challenge, you could try hiking the BCMC trail, the Deep Cove Quarry hike, the Chief, or any other local hike that doesn’t require much hard work, and is easy to follow. Be careful with your footing, and remember that animals are more likely scared of you than you are of them. It’ll be worth the near heart-attacks in the end, stick around until sunrise and take in a view that very, very few have seen!",
      "6. Dreamweaver Trail",
      "This trail is only a murmur on the internet, but trying to find the trail is quite an adventure in itself. Weaving in and out of cool mountain biking trails (including “Bitches Brew”) this trail is quite an easy trek in the North Shore forest. The highlight would have to be a sketchy make-shift bridge that has you walking very slowly over a deep canyon, before kissing the ground again in exhilaration. Until you get to a clearing and you’re meant to cross a fallen log before hauling yourself up to Grouse Mountain. The Dreamweaver Trail is a fun way to spend an afternoon searching for a path that isn’t traveled by many. It’s worth it for the bridge though!"
    ],
    "img": "stanley-park.jpg",
    "source": "Bored in Vancouver",
    "src": "http://boredinvancouver.com/listing/6-adventurous-day-hikes-near-vancouver/",
    "title": "6 Adventurous Day Hikes Near Vancouver"
  }
]