[
  {
    "id": "black-tusk",
    "camping": "Yes",
    "description": [
        "The dark, jagged edges of Black Tusk make it one of the most scenic and unique hikes in southwestern British Columbia. Located in Garibaldi Provincial Park, Black Tusk is the most spectacular mountain in the area.",
        "While many hikers do complete this trail in a day, the distance and elevation gain make for a very long day. For this reason, some people prefer to hike to Garibaldi Lake or Taylor Meadows and camp overnight, and then hike to Black Tusk the following day. It is up to you which you prefer, however if you do decide to do this in a day, make sure to leave plenty of time to return to the parking lot during daylight hours.",
        "Start your hike from the wooden steps in the upper section of the Rubble Creek parking lot. The dirt trail climbs steadily for the first 6km until you reach a junction. Going right takes you to Garibaldi Lake, so take the trail to the left to head up towards Taylor Meadows and eventually on to Black Tusk.",
        "The trail continues to climb gradually eventually emerging from the forest and into more wide open space as you enter into Taylor Meadows. Continue along the trail as it enters into the Taylor Meadows campsite area. Pass the camping area and continue along the trail as it meanders through the meadows. In the late summer and early fall, the alpine flowers are in full bloom and their beautiful colours are scattered across the land like a beautiful piece of art.",
        "Eventually, you arrive at a junction with a map and wooden bench. Continue going straight along the trail for a short distance and watch for a sign and trail on your left that point the way to Black Tusk. Take this trail and immediately start your uphill trek.",
        "The trail climbs quickly, passing over small runoff streams and evidence of rockslides that have occurred over thousands of years. As you gain elevation, look back occasionally at the view of Garibaldi Lake below.",
        "As the trail continues, the trees and vegetation become fewer eventually giving way to a completely rocky terrain. The trail emerges onto a small ridge at a BC Parks sign with a full view of Black Tusk ahead of you. From this point on, BC Parks does not maintain a trail, however evidence of a path is still visible from the many hikers who trek through here each year.",
        "The next section of trail is a scramble over loose shale towards the base of the Tusk. Read the BC Parks sign carefully and understand that continuing further is at your own risk. Passing the BC Parks sign will begin with a steep uphill climb. The loose shale slides with each step you take making it seem like you slide back one step for every two steps you move forward.",
        "The trail eventually emerges onto a ridge next to the base of the Tusk that offers a scenic view of the entire area surrounding Garibaldi Lake. Be careful on the loose rocks as some of the cliffs in the area are high enough to cause very serious injuries or even death.",
        "Most hikers end their hike to the Tusk at this point before heading back. Although it is possible to make it onto the peak of the Tusk it is not recommended as it is extremely dangerous and discouraged by BC Parks. However, it is sometimes attempted by experienced rock climbers with the proper equipment and training. To reach the chute that you can climb to the top, follow the base of the Tusk, stepping carefully to make sure you don't slide down the hill. The shale is very loose and pulling yourself up through the chute generally pulls off pieces of rock from the Tusk. Even experienced rock climbers must keep in mind that they have to come back down this same route."
    ],
    "difficulty": "Hard",
    "distance": "29",
    "dogFriendly": "No",
    "dogs": "Dogs are NOT allowed at Black Tusk or on any trails in Garibaldi Provincial Park.",
    "drivingInstructions": [
        "To reach the Rubble Creek parking lot, the start of the trail to Black Tusk via the Garibaldi Lake area, take Highway #1 (Trans Canada Highway) west towards Horseshoe Bay. Just before the ferry terminal, watch for signs to Squamish and merge onto Highway #99 North (Sea to Sky Highway). Continue driving along the highway until reaching the town of Squamish 45km later. At this point, it's a good idea to make sure you have enough gas, water, and food for the day as there are no other places to stop between here and the trailhead.",
        "Continue along Highway #99 northbound towards Whistler for another 32km. Watch for Garibaldi Provincial Park signs on your right. The turnoff is a small, paved road on the right of the highway that is easy to miss. If you pass over a bridge with a large dam on the right, you have just passed it and will have to find a place to turn around and head back.",
        "Once on the Rubble Creek Road, continue for a couple of kilometers until you reach the parking lot."
    ],
    "drivingTime": "1 hour 45 minutes",
    "gain": "1740 m",
    "img": "black-tusk.jpg",
    "latitude": "49.9753",
    "longitude": "-123.0428",
    "name": "Black Tusk",
    "region": "Whistler",
    "season": "July - October",
    "time": "11",
    "toilets": "Pit toilets are located at several points along the route to Black Tusk including at the Rubble Creek parking lot, Taylor Meadows campsite, the Black Tusk junction, and Garibaldi Lake.",
    "transit": "No"
  },
  {
    "id": "bowen-lookout",
    "camping": "No",
    "description": [
        "The Bowen Lookout is an incredible viewpoint that is located near the Cypress Mountain ski area and overlooks Howe Sound, out towards Bowen Island. The hike is relatively short, with a steep climb and is often done as a short side-trip on the way to St Mark's Summit.",
        "From the downhill ski area at Cypress, walk past the lodge and continue to the trail map located at the far end. Start the trail to the right of the trail map board and walk down the gravel trail as it heads into the forest.",
        "Almost immediately, you reach a junction with the Howe Sound Crest Trail East. You can go either route as both trails take you to the Bowen Lookout, however this description will go right and then come back along the other route.",
        "Go right and follow the trail uphill briefly to where it exits onto the side of a ski run and continues climbing. When you reach a large water tower, there is a junction with the Howe Sound Crest Trail to the right. Do not take this trail, instead go to the left and walk around the water tower, following the wide, level path as you quickly make time.",
        "Along the wide path, you will pass a junction to the left with a sign. Note this junction as you will return via this route. Continue along the wide path as it narrows and then reaches a wooden bridge where it veers to the right. This is where the trail begins to really climb.",
        "Follow the gravel path as it climbs steeply through a series of switchbacks until it reaches a sign with the junction to the Bowen Lookout. Go left at the sign and walk down the hill to the end, where you are greeted with a scenic view looking out towards Howe Sound and Bowen Island.",
        "After enjoying the view, retrace your steps by walking back up the hill to the main trail, then go right as you begin to descend quickly through the switchbacks. Cross the wooden bridge and veer to the left, following the path as it begins to widen.",
        "Watch for a trail sign on your right and go right at that junction towards Yew Lake (note: Dogs are not permitted on this trail and you will have to continue straight, going back the way you came). Immediately there is another junction but this is a very small loop within the forest, so you can go either way. At the other end of the forested loop, take the trail out of the forest and pass by a bog where the trail then joins with the Yew Lake Loop Trail.",
        "For the quickest route back to the trailhead, go left and walk along the gravel path and before long, you return to the area with the map where you began. For a slightly longer route, go right and walk around Yew Lake, returning to the same area next to the map."
    ],
    "difficulty": "Easy",
    "distance": "4",
    "dogFriendly": "On-Leash",
    "dogs": "Dogs are allowed on the Howe Sound Crest Trail and the route to the Bowen Lookout but No Dogs are allowed on the trail around Yew Lake. Dogs must be on a leash at all times. Please watch for signs and pick up after your dog.",
    "drivingInstructions": [
        "The Bowen Lookout is located near Cypress Mountain and the route begins from the downhill ski area.",
        "From Downtown",
        "Drive to Georgia Street and follow it heading westbound towards the Stanley Park causeway, continuing across the Lions Gate Bridge. After crossing the bridge, stay to the left and follow the exit towards West Vancouver. At the first set of traffic lights, turn right onto Taylor Way and drive up the hill. Watch for signs to Highway #1 Westbound and turn left, entering the highway heading towards Horseshoe Bay.",
        "Take Exit #8 to Cypress Mountain and follow Cypress Bowl Road as it veers to the right and begins to ascend up the hill. As you arrive at the ski area near the top, go left and continue to the downhill ski area parking lot. Park as close to the buildings as possible as the trail begins on the far end of the Crazy Raven Bar and Grill.",
        "From Highway #1",
        "Drive to Highway #1 and enter the highway heading westbound. Cross the Second Narrows bridge and continue through North Vancouver into West Vancouver. Take Exit #8 to Cypress Mountain and follow Cypress Bowl Road to the top. Go left near the top, driving towards the downhill ski area and park close to the buildings. The trail begins on the far end of the Crazy Raven Bar and Grill."
    ],
    "drivingTime": "45 Minutes",
    "gain": "110 m",
    "img": "bowen-lookout.jpg",
    "latitude": "49.4281",
    "longitude": "-123.2161",
    "name": "Bowen Lookout",
    "region": "The North Shore",
    "season": "July - October",
    "time": "1.5",
    "toilets": "Washrooms are located near the downhill ski area for Cypress Mountain before starting the hike. There are no toilet facilities along the trail to the Bowen Lookout.",
    "transit": "No"
  },
  {
    "id": "crystal-falls",
    "camping": "No",
    "description": [
        "Located east of Vancouver in Coquitlam, Crystal Falls is a scenic waterfall that drains into the Coquitlam River and is along a short, easy hike trail. The area is also popular with dog walkers and mountain bikers and the route can be very muddy for several months of the year, including small small streams that you have to step through or carefully cross trying not to get your shoes wet.",
        "From the unmarked trailhead on Karley Crescent, walk into the forest, down the short slope, and along the path as it runs parallel to the Upper Coquitlam River. The trail dips down to the edge of the river before climbing back uphill and continue northward to the falls. Continue walking as the route weaves its way along the shore and through the scenic, moss covered forest. After about 40 minutes, there is an old blue pickup truck abandoned on your left. From here, it's about another 15 minutes up the trail, crossing several more small streams, and finally arriving at a larger creek where Crystal Falls sits just a few meters further upstream.",
        "The area can be quite busy during the warmer weather months, so choose a place to sit and enjoy a snack while taking in the sights and sounds of the waterfall. Once you're ready to head back, walk down the trail, crossing the small streams, past the old pickup truck, and eventually out to the neighbourhood where you started your hike."
    ],
    "difficulty": "Easy",
    "distance": "7",
    "dogFriendly": "Yes",
    "dogs": "Please ensure to pickup after your dog and keep your dog under control at all times.",
    "drivingInstructions": [
        "The trail to Crystal Falls is located on the Coquitlam River along a residential area on Karley Crescent. To drive to the trail from Vancouver, head east to Highway #1 and get onto the highway eastbound. Turn off the highway at Exit #44 BC-7 / United Boulevard and stay in the left lane as you go over an overpass and onto Lougheed Highway.",
        "Continue driving straight along Lougheed until you reach a major intersection with Coquitlam Centre Shopping Mall on the other side. Go straight through the lights as the road now becomes Pinetree Way. Several blocks later, turn right onto Guildford Way and drive east. Then make a left onto Pipeline Road, driving past several sports fields to a light at David Avenue. Turn right onto David Avenue and less than 1km from here, turn left onto Shaughnessy Street. The trailhead is directly in front of you at the end of Shaughnessy Street, where it meets Karley Crescent.",
        "Note: This is a residential area so please be respectful of those who live nearby when parking in the area, making sure not to block access to their properties."
    ],
    "drivingTime": "45 Minutes",
    "gain": "Minimal",
    "img": "crystal-falls.jpg",
    "latitude": "49.3438",
    "longitude": "-122.7632",
    "name": "Crystal Falls",
    "region": "Tri Cities",
    "season": "Year-round",
    "time": "2",
    "toilets": "There are no toilet facilities located on or near the trail to Crystal Falls in Coquitlam.",
    "transit": "Yes"
  },
  {
    "id": "cypress-falls",
    "camping": "No",
    "description": [
        "Cypress Falls is the perfect hike to do during the winter months when other trails at higher elevations are buried under snow. Just a short walk takes you through a dense forest full of old Cedar and Douglas Fir trees while following Cypress Creek up past two beautiful waterfalls.",
        "From the parking lot, walk past the outhouse and towards the trail that heads into the forest. Go left and walk towards the sound of rushing water as the trail gradually makes its way uphill. A few steps from the parking lot, you arrive at the first junction. Continue to your left, as later, we will return along the other trail on the way back.",
        "The hiking trail winds through forests of Douglas Fir and Western Red Cedar trees covered in moss from the moist environment. Just a little further along the trail and at the bottom of a short hill is a viewpoint of the lower Cypress Falls from a rocky viewing area. Stop to take in the rushing water as it flows over the edge and drops into the canyon below.",
        "Continue along the trail towards the wooden bridge up ahead. Later we will cross the bridge but first continue up the steep section of the trail as it follows alongside the creek towards the upper falls. Fallen trees and stumps alongside the trail play an important role in replenishing the forest as new growth can be seen sprouting from the dead wood.",
        "Continue up the steep hill until you reach a chain-link fence with a large warning sign on it. This is the border of Cypress Falls Park and beyond this point belongs to a development company, which allows hikers to use their land. Continue past the fence and uphill, as it’s only a short distance to the upper falls."
    ],
    "difficulty": "Easy",
    "distance": "3",
    "dogFriendly": "Yes",
    "dogs": "Cypress Falls is a dog-friendly park and dogs are allowed to be off-leash but under control. Please make sure to pick up after your dog and pack out and dispose of all waste so it does not attract bears and other wildlife.",
    "drivingInstructions": [
        "To get to the start of the Cypress Falls Trail, head westbound along Highway #1 and take Exit #4 to Woodgreen Drive / Caufield Drive. At the stop sign, turn right onto Woodgreen Drive and continue along the road as it bends to the left and heads up a hill. Turn right at the third street on your right called Woodgreen Place. The gravel driveway at the end of the street leads to the parking lot and the trailhead."
    ],
    "drivingTime": "30 Minutes",
    "gain": "130 m",
    "img": "cypress-falls.jpg",
    "latitude": "49.3521",
    "longitude": "-123.2407",
    "name": "Cypress Falls",
    "region": "The North Shore",
    "season": "Year-round",
    "time": "1.5",
    "toilets": "There is a pit toilet located at the start of the trail to Cypress Falls.",
    "transit": "Yes"
  },
  {
    "id": "diez-vistas",
    "camping": "No",
    "description": [
        "Named Diez Vistas for its ten views, this hike offers beautiful scenery overlooking Indian Arm as you make your way around the Buntzen Lake area.",
        "The hike begins from the north end of the main Buntzen Lake parking lot. Follow the Buntzen Lake Trail southbound to the southernmost end of the lake and cross a floating bridge through a marshy area. Once on the other side continue straight past the Diez Vistas sign, crossing the service road that goes left then right before beginning the climb uphill. The trail meanders through the forest as you slowly make your way uphill eventually coming to a clearing with power lines above. Continue straight and after walking another 10 minutes, a series of switchbacks begin. This is the steepest part of the hike.",
        "After passing through the switchbacks, you will be treated to your first view of Sasamat Lake and Belcarra Regional Park with Burnaby and Vancouver off in the distance. Take a break here before continuing up the much less steep hill to the second viewpoint that overlooks Buntzen Lake and the busy beach area below.",
        "Once you have taken in the second view, continue along the trail as it makes its way up and down through the forest until reaching the third viewpoint. This is probably the best view that overlooks much of Indian Arm with a clear view of Deep Cove directly ahead and downtown Vancouver off to the left in the distance. On the other side of Indian Arm, towering high above the water are the three visible peaks of Mount Seymour.",
        "From this point the trail continues along the ridge with occasional views of Indian Arm and the houses along the west side. Some viewpoints are better than others as the foliage has grown over the years. The hike weaves its way through forested areas and gradually descends back downhill until you reach a gravel road. At the gravel road, turn right and walk a short distance towards the north end of Buntzen Lake."
    ],
    "difficulty": "Medium",
    "distance": "15",
    "dogFriendly": "Yes",
    "dogs": "Dogs are allowed on the Diez Vistas Trail but must be kept on a leash at all times. Dogs are only allowed to be off-leash in the designated areas around Buntzen Lake. Please pick up after your dog and dispose of all waste in bear proof garbage bins around the park.",
    "drivingInstructions": [
        "The Sendero Diez Vistas Trail begins from the Buntzen Lake parking lot in Port Moody, approximately 30km from Vancouver. To get there, head east along Hastings Street, through Vancouver and Burnaby. Hastings eventually turns into the Barnett Highway. Continue along the Barnett until you reach the lights at St. Johns Street. Drive for almost 1km until you reach the intersection at Ioco Road and make a left turn. Continue straight as the road turns into Heritage Mountain Blvd and heads up a steep road eventually reaching a roundabout. Turn right here and turn left at the first set of lights onto Forest Parkway. At the first stop sign, turn left onto Aspenwood Drive and continue straight as it turns into E. Road. Turn right onto Sunnyside Road at the Buntzen Lake sign and continue straight until you reach the park entrance. Continue past the park gate and down the paved forest road until you reach the parking lot."
    ],
    "drivingTime": "1 Hour",
    "gain": "460 m",
    "img": "diez-vistas.jpg",
    "latitude": "49.3541",
    "longitude": "-122.8755",
    "name": "Diez Vistas",
    "region": "Tri Cities",
    "season": "April - November",
    "time": "6.5",
    "toilets": "There are no toilets along the Diez Vistas Trail however, there are pit toilets at the north beach and washroom facilities at the south beach of Buntzen Lake.",
    "transit": "Yes"
  },
  {
    "id": "dog-mountain",
    "camping": "No",
    "description": [
        "The Dog Mountain Trail is a short, easy hike from Mount Seymour that offers a spectacular view of Vancouver on a clear day. While the trail has minimal elevation gain and is only about 5km return, it should be noted that the path is a bit more technical, requiring careful steps along several sections that are covered with slippery tree roots. Therefore, some hikers may find this trail on the more challenging end of the “easy” rating.",
        "From the parking lot, walk towards the BC Parks sign at the northwest corner. Walk north along the wide gravel trail for about 20 meters until you see a small sign and a trail that goes into the trees on your left.",
        "Enter and walk down the small hill to the first bridge crossing a small stream. The trail makes its way around tree roots and through rocky areas staying relatively flat with only the occasional small hill. In the winter, the trail is nice snowshoe along.",
        "After walking for 1.1km, you arrive at First Lake. Walk across the small bridge and along the lake shore to the sign on the far side pointing the way to Dog Mountain. It’s just over 1km to Dog Mountain from this point, however the next section of the trail has a few more hills than the first. Continue along the trail making your way past the small streams and over cute little wooden bridges.",
        "As you near the peak of Dog Mountain, the trail will veer to the left. Continue along the path and step onto the rocky outcrop as you make your way out of the forest and towards the stunning view of North Vancouver below and Lions Gate Bridge, Stanley Park, and downtown Vancouver off in the distance."
    ],
    "difficulty": "Easy",
    "distance": "5",
    "dogFriendly": "On-Leash",
    "dogs": "Dogs must be on a leash at all times on Seymour Mountain hiking trails. Please pick up after your dog and dispose of all waste in designated bear proof garbage bins.",
    "drivingInstructions": [
        "The Dog Mountain Trail starts at the top of Mount Seymour in North Vancouver. To reach the parking lot, drive east to the Trans Canada Highway (Highway #1) and enter the highway heading westbound. Continue across the Iron Workers Memorial Bridge (Second Narrows) and take Exit #22, Mt. Seymour Parkway, shortly after crossing the bridge. At the set of lights, turn right onto Mt. Seymour Parkway and continue along the parkway for about 4km until you reach the traffic lights and small shopping area at Mt. Seymour Road. Turn left onto Mt. Seymour Road and continue straight as the road begins to climb up Mount Seymour for the next 13km. Once at the parking lot, the trail begins near the furthest northwest corner."
    ],
    "drivingTime": "50 Minutes",
    "gain": "Minimal",
    "img": "dog-mountain.jpg",
    "latitude": "49.3733",
    "longitude": "-122.9700",
    "name": "Dog Mountain",
    "region": "The North Shore",
    "season": "June - October",
    "time": "2",
    "toilets": "Toilets are located near the parking lot of the Seymour Mountain ski area.",
    "transit": "No"
  },
  {
    "id": "elfin-lakes",
    "camping": "Yes",
    "description": [
        "Elfin Lakes are two small lakes located in the scenic alpine setting of Garibaldi Provincial Park near Squamish, British Columbia.",
        "From the parking lot, pass the yellow gate and begin heading uphill along the wide gravel road. Originally, this was the main road to access the old Diamond Head Lodge at Elfin Lakes. However, it is solely used today by hikers and mountain bikers to access Elfin Lakes.",
        "After hiking for just over an hour, you arrive at the shelter at Red Heather Meadows. The shelter is used in the winter by snowshoers and cross-country skiers as a place to warm up and in the summer months as a place for hikers to use the outhouse just beyond the building.",
        "As you continue up the trail past the shelter, follow the narrow hiking trail for the next kilometer. The vegetation begins to thin and becomes very sensitive as you approach the alpine area. The narrow trail eventually joins back up with the wide gravel road. Go left and continue gradually heading uphill, admiring the beautiful alpine scenery to your left. As the trail begins to level, the two huts at Elfin Lakes can be seen off in the distance.",
        "For the next 30 minutes, the trail descends towards the Elfin Lakes before arriving at a view above the lakes of the surrounding area. Make the final descent down towards the first lake and stop to take photos and enjoy the view.",
        "People are allowed to swim in the top lake, however the lower lake is reserved for drinking water only and must be kept clean. The ranger station is just beyond the second lake and a bit further down the trail is the overnight shelter used by hikers who plan on hiking to further destinations such as Opal Cone, the Gargoyles, or Mamquam Lake.",
        "After stopping for lunch at the lakes, head back onto the trail in the direction you arrived from. The first section is a steady uphill climb as you make your way back up to the rocky ridge. Once there, it's all gradually downhill as you continue towards the warming shelter leaving the alpine scenery behind. Pass the warming hut and head back downhill towards the parking lot where you began your day."
    ],
    "difficulty": "Medium",
    "distance": "22",
    "dogFriendly": "No",
    "dogs": "Dogs are NOT allowed at Elfin Lakes or on any trails in Garibaldi Provincial Park.",
    "drivingInstructions": [
        "Elfin Lakes is located in the southern area of Garibaldi Provincial Park near the town of Squamish. From Vancouver, take Highway #1 (Trans Canada Highway) westbound towards Horseshoe Bay and follow the turnoff onto Highway #99 (Sea to Sky Highway). At the town of Squamish, watch for the turnoff to Mamquam Road or the Valley Golf Country Club. Continue along Mamquam Road as it heads uphill and becomes a gravel road. At the fork in the road, go left and continue up the dirt road to the parking lot.",
        "Note: This parking lot does have a reputation for several car-related thefts, so do not leave any valuables in your vehicle."
    ],
    "drivingTime": "1 hour 45 Minutes",
    "gain": "600 m",
    "img": "elfin-lakes.jpg",
    "latitude": "49.7856",
    "longitude": "-122.9886",
    "name": "Elfin Lakes",
    "region": "Howe Sound",
    "season": "July - October",
    "time": "6",
    "toilets": "Outhouses are located in several places including at the parking lot, just beyond the Red Heather Meadows shelter, and near Elfin Lakes. Please ensure to bring your own toilet paper.",
    "transit": ""
  },
  {
    "id": "garibaldi-lake",
    "camping": "Yes",
    "description": [
        "With turquoise-coloured water nestled between alpine mountains and a spectacular glacier as the backdrop, Garibaldi Lake is one of the most scenic destinations in British Columbia.",
        "Accessible from the Rubble Creek parking lot just south of Whistler, the hike begins at the wooden steps along the top section of the parking lot. The first 6km of the trail is a gradual uphill climb through dense forests of Douglas Fir trees. At times, the trail can seem like it goes on forever, however keep moving as the reward will be well worth the effort.",
        "Shortly after the 6km mark, you reach a junction with a map of the surrounding area. Going right takes you directly to Garibaldi Lake, the perfect option for those who may be short on time or want a shorter hike. However, going left and adding a few kilometers onto the hike takes you up through Taylor Meadows, a magnificent area filled with colours from alpine flowers that cover the sides of the trail during the late summer and early fall. At the junction, go left and head towards Taylor Meadows.",
        "After another 20 minutes of gradual uphill, the trail begins to level and you arrive at the Taylor Meadows campsite. Looking up to the left between the trees reveals the towering peak of Black Tusk.",
        "Continue along the trail through the meadows occasionally stopping to check out the view behind you. The meadows are very sensitive to any sort of foot traffic, so it is important that hikers stay on the marked trails in order to protect and promote the growth of this ecologically sensitive environment.",
        "Eventually, you arrive at another main junction where you have the choice of continuing to Black Tusk or Panorama Ridge. We will save these long and difficult hikes for another day and head off to the right towards Garibaldi Lake.",
        "The trail continues it's meandering path through the meadows for the next 20 minutes. The trail eventually begins to head downhill through a series of switchbacks offering the occasional views of the turquoise-coloured lake through the trees.",
        "Once you reach the bottom of the switchbacks, watch for a sign and a trail that goes down a steep dirt slope. Take this path as it heads down towards the river draining from Garibaldi Lake and a wooden bridge crossing. Cross the bridge and continue to the left towards the lake. As you continue walking, the lake becomes more and more visible until you reach a wooden structure where the trees open up completely revealing a panoramic view of the entire lake and glacier off in the distance. From this point on, there are several places that offer scenic views. Pick one that is less busy and stop to take a break and soak up the view.",
        "Once you are satisfied you have taken enough photos and are ready to head back to the parking lot, walk back alongside the lake where you came towards the wooden bridge that crosses the river. Head up the steep path to the junction but this time, go left. This trail will go directly to the first junction, bypassing Taylor Meadows.",
        "Continue along the trail as it passes two other smaller lakes that Garibaldi Lake drains into. These lakes also offer beautiful scenery but they are not quite as spectacular as their mother lake.",
        "After passing the second lake, continue into the forest and a short distance later the first junction appears that you passed earlier in the day. Continue straight back downhill towards the Rubble Creek parking lot. The next 6km are long but keep in mind the accomplishment and reward of getting to enjoy one of the most beautiful places in British Columbia."
    ],
    "difficulty": "Medium",
    "distance": "18",
    "dogFriendly": "No",
    "dogs": "Dogs are NOT allowed at Garibaldi Lake or on any other trails in Garibaldi Provincial Park.",
    "drivingInstructions": [
        "To reach the Rubble Creek parking lot, the start of the trail to Garibaldi Lake, take Highway #1 (Trans Canada Highway) west towards Horseshoe Bay. Just before the ferry terminal, watch for signs to Squamish and merge onto Highway #99 (Sea to Sky Highway) heading north. Continue driving along the highway until reaching the town of Squamish 45km later. At this point, it's a good idea to make sure you have enough gas, water, and food for the day as there are no other places to stop between here and the trailhead.",
        "Continue along Highway #99 northbound towards Whistler for another 32km. Watch for Garibaldi Provincial Park signs on your right. The turnoff is a small, paved road on the right of the highway that is easy to miss. If you pass over a bridge with a large dam on the right, you have just passed it and will have to find a place to turn around and head back.",
        "Once on Rubble Creek Road, continue for a couple of kilometers until you reach the parking lot."
    ],
    "drivingTime": "1 hour 45 Minutes",
    "gain": "820 m",
    "img": "garibaldi-lake.jpg",
    "latitude": "49.9366",
    "longitude": "-123.0272",
    "name": "Garibaldi Lake",
    "region": "Whistler",
    "season": "July - October",
    "time": "5",
    "toilets": "Pit toilets are located at several points along the route to Garibaldi Lake including at the Rubble Creek parking lot, Taylor Meadows campsite, the Black Tusk junction, and Garibaldi Lake.",
    "transit": "No"
  },
  {
    "id": "grouse-grind",
    "camping": "No",
    "description": [
        "The Grouse Grind is Vancouver’s most used trail and is renowned for its challenge in requiring physical strength and endurance in order to make it to the top. In less than 3km, the trail climbs more than 850m. Due to the large number of people that use this trail, primarily for exercise, maintenance workers have had to build wooden stairs on much of the path in order to prevent further erosion from overuse.",
        "The trail begins just east (right) of the Grouse Mountain Gondola in an area with posts set up for hikers to use for stretching their arms and legs before the hike. Walk past the gate and over the small bridge and immediately begin your uphill ascent. The trail levels out until you reach a sign at a fork in the trail. Go left at the fork and continue your uphill climb making your way over rocks, roots, and wooden steps. After 15 minutes or so, you cross a small bridge over a dried-up creek. It’s only another 10 minutes to the first quarter mark.",
        "Each quarter mark is clearly shown with large signs and can be a relief or an indication on whether to continue or not. If you are struggling at the first quarter mark or have run out of water, it’s probably a better idea to walk back down as there is still a long, grueling way to go and you could potentially run into some serious problems if you choose to continue.",
        "For those continuing, the trail weaves its way uphill over more wooden steps. The third quarter is the steepest with the trail traversing over rock in some sections. The fourth quarter is also quite steep with some sections containing very large steps. Keep going, you’re almost there.",
        "Once at the top, you have earned bragging rights by saying you have completed ‘The Grind’. Walk towards the Grouse Mountain Chalet and up the stairs to the entrance. Just inside, you can buy your ticket for the Gondola ride before heading back down, have a beer at the bar, or wander around the top of Grouse Mountain to check out the events or scenery."
    ],
    "difficulty": "Hard",
    "distance": "2.9",
    "dogFriendly": "No",
    "dogs": "Dogs are NOT allowed on the Grouse Grind or at the top of Grouse Mountain due to the steepness and danger posed to the daily crowds who hike the trail and visit the attractions at the top.",
    "drivingInstructions": [
        "The Grouse Grind Trail starts from the parking lot at the base of Grouse Mountain.",
        "From Downtown",
        "Drive westbound along Georgia Street and continue along the Stanley Park Causeway and across the Lions Gate Bridge. Right after crossing the bridge, take the right-hand turnoff to North Vancouver and immediately change lanes into one of the furthest left two lanes. At the first set of lights, the left two lanes turn onto Capilano Road. Follow Capilano Road as it continues northbound, passing the Capilano Suspension Bridge and Capilano Dam, until it ends up in the Grouse Mountain parking lot.",
        "From Highway #1",
        "Take the Trans Canada Highway (Highway #1) westbound across the Iron Workers Memorial Bridge (Second Narrows Bridge) to North Vancouver and take the Capilano Road Exit. Turn right onto Capilano Road and head northbound until it ends up in the Grouse Mountain parking lot."
    ],
    "drivingTime": "30 Minutes",
    "gain": "853 m",
    "img": "grouse-grind.jpg",
    "latitude": "49.3801",
    "longitude": "-123.0814",
    "name": "Grouse Grind",
    "region": "The North Shore",
    "season": "June -September",
    "time": "1.5",
    "toilets": "Washrooms are located near the gondola at the base of the mountain and inside the guest services area at the top of Grouse Mountain.",
    "transit": "Yes"
  },
  {
    "id": "joffre-lakes",
    "camping": "Yes",
    "description": [
        "Joffre Lakes is one of BC’s most beautiful hikes and is relatively easy to access compared to other alpine lakes. From the parking lot just off the Duffey Lake Road, head along the trail staying to your left at the fork and in just minutes you will reach the first of three lakes. The view is amazing with the glacier sitting high above the mountains.",
        "Head back up the trail to the fork and turn left along the path and across a bridge following the trail along the edge of the lake. After 5 minutes, the trail will begin to head uphill and continue through forested area. After about 20 minutes, you will come to a boulder field. Cross the enormous rocks, being careful not to slip or place your foot into a crevice.",
        "After passing through the boulder field, you will hear the sound of Joffre Creek another 20 minutes away. Continue up the steep hill and cross over the fallen tree bridge. A short distance from here, you will see Middle Joffre Lakes.",
        "Continue along the trail that weaves along the shoreline of Middle Joffre Lakes and cross over Joffre Creek again. Make your way up the steep rocks and switchbacks and back into the trees.",
        "Another 20 minutes past Middle Joffre Lakes and you will start to see Upper Joffre Lakes emerge with the glacier providing a beautiful backdrop. Continue along the trail next to the lake and across a small bridge. The trees open up and make way for enormous rockslides and it’s at this point where you can decide to stop to rest. You can continue as far up to the base of the glacier, following the river that feeds the upper lake from the melting ice, or just pick a spot next to the lake to enjoy your lunch."
    ],
    "difficulty": "Medium",
    "distance": "10",
    "dogFriendly": "No",
    "dogs": "Dogs must be kept on a leash at all times in Joffre Lakes Provincial Park. Please pick up after your dog and pack out all waste. There are no garbage facilities beyond the parking lot at Joffre Lakes.",
    "drivingInstructions": [
        "To reach the trailhead of Joffre Lakes, take Highway #99 (Sea To Sky Highway) northbound through Squamish, Whistler, and Pemberton. Continue straight through the lights at Pemberton, along the highway towards the town of Mt. Currie. Turn right at the intersection with the sign towards Lillooet. Zero your odometer and continue along the winding road, past Lillooet Lake before heading up a steep hill. After traveling 21km from the intersection in Mt. Currie, watch for signs to the Joffre Lakes parking lot. The trail begins at the furthest end at the bottom of the lot."
    ],
    "drivingTime": "3 Hours",
    "gain": "370 m",
    "img": "joffre-lakes.jpg",
    "latitude": "50.3413",
    "longitude": "-122.4762",
    "name": "Joffre Lakes",
    "region": "Pemberton",
    "season": "June - September",
    "time": "4",
    "toilets": "Pit toilets are located at the parking area and at the campsite at Upper Joffre Lakes.",
    "transit": "No"
  },
  {
    "id": "jug-island-beach",
    "camping": "No",
    "description": [
        "Jug Island is a tiny gorgeous island located just off the northern tip of Belcarra Regional Park. The island itself is not accessible but you can hike to a beach that faces the island and offers great views of Indian Arm.",
        "From the parking lot, walk towards the covered picnic table area and look for a trail that enters into the forest and a sign pointing to Jug Island. Follow the trail a short distance and cross the road, being careful of oncoming traffic. Immediately after crossing the road, take the trail on the left.",
        "The trail begins to climb quite quickly as you work your way up the gravel path. The trail eventually levels out giving you a chance to catch your breath before continuing through the moss covered forest. The trail begins to widen as you cover quite a bit of distance quickly on the slight downward slope.",
        "Eventually, the trail reaches a junction. Go right and follow the trail as it, again, begins to ascend to the high point of the hike. As you reach the top of the mountain, look to your right at the view across Bedwell Bay and the water down below. Continue for a short flat section before the trail makes its final, steep descent down towards the beach area.",
        "There in front of you stands Jug Island, just off the shore. Walk along the beach to find a good place to sit and enjoy the views of Indian Arm and watch for eagles and seals that frequent the area."
    ],
    "difficulty": "Medium",
    "distance": "5.5",
    "dogFriendly": "On-Leash",
    "dogs": "Dogs on-leash are permitted on the trail to Jug Island Beach and within most areas of Belcarra Regional Park. Dogs are not allowed on swimming beaches within the park. Please pick up after your dog.",
    "drivingInstructions": [
        "The trail to Jug Island Beach is located in Belcarra Regional Park in the quiet town of Belcarra. To get to Belcarra Regional Park from Vancouver, drive east along Hastings Street, continuing through Burnaby and merge with the Barnett Highway. Continue until you reach the traffic lights and turn left onto St. Johns Street. Drive east along St. Johns St. and turn left at the lights onto Ioco Road. Drive past the mall on the right and turn left at the 3rd set of traffic lights, onto Ioco Road. It seems strange being on Ioco and then turning left onto the same street name. At this light, going straight up the hill turns into a different street name, therefore you want to turn left and continue on Ioco Road.",
        "Follow the road as it weaves along the shore passing many houses on both sides of the road. Turn right onto 1st Avenue and a short distance later when the road forks, go left onto Bedwell Bay Road. After passing Sasamat Lake on your right, you reach a stop sign. Turn left at the stop sign and follow the winding road up hill, passing the yellow metal gate. Continue following this route until you finally descend into Bedwell Bay and arrive at the parking lot of Belcarra Regional Park.",
        "Note: If you miss turning left at the stop sign near Sasamat Lake, you will end up driving into the town of Belcarra. You will end up at Belcarra Regional Park, however, due to the limited space, there is no public parking available. You must drive all the way back to Sasamat Lake and turn right, following the route up and over the hill towards the Belcarra Regional Park parking lot."
    ],
    "drivingTime": "1 Hour",
    "gain": "100 m",
    "img": "jug-island-beach.jpg",
    "latitude": "49.3219",
    "longitude": "-122.9191",
    "name": "Jug Island Beach",
    "region": "Tri Cities",
    "season": "Year-round",
    "time": "2.5",
    "toilets": "There are public toilets located next to the parking lot. There is also an outhouse near the Jug Island Beach.",
    "transit": "Yes"
  },
  {
    "id": "lighthouse-park",
    "camping": "No",
    "description": [
        "Lighthouse Park is one of Greater Vancouver's most beautiful parks located along the shores of West Vancouver. The park boasts some of the largest Douglas Fir trees in Greater Vancouver as well as breathtaking views of the water.",
        "There are a variety of trails through the park that take you past old growth Western Red Cedar and Douglas Fir trees. The trails are all fairly easy with only a few having a short hill to ascend or descend. Take a look at the park map at the trailhead and plan your route so that you do a circle through the park and end at the lighthouse.",
        "For those who just want a short walk down towards the lighthouse, follow the wide trail for about 10 minutes. To the right of the picnic tables, a path leads up onto a rocky outcrop giving a view of the lighthouse just over the tree line.",
        "Another picturesque location is at Starboat Cove. It's a short 15-minute walk east from the lighthouse where there is a sign for a steep path that takes you down to the beach area. At low tide, this is the perfect area to have a picnic and enjoy the view that extends from the Lions Gate Bridge to the University of British Columbia to Vancouver Island on a clear day."
    ],
    "difficulty": "Easy",
    "distance": "6",
    "dogFriendly": "On-Leash",
    "dogs": "Dogs are allowed in Lighthouse Park but must be kept under control. Please be advised of signage that may not allow dogs on some trails within the park. Please pick up after your dog and dispose of all waste in garbage bins located throughout the park.",
    "drivingInstructions": [
        "To get to Lighthouse Park, head westbound along Marine Drive in West Vancouver. As Marine Drive continues past little shops and businesses, it will begin to narrow and the road will wind around the coastline. Continue past Caufield Cove Marina and watch for the Lighthouse Park sign on your left. Turn left on Beacon Lane and continue straight until you reach the parking lot. The trail begins at the top of the lot."
    ],
    "drivingTime": "40 Minutes",
    "gain": "Minimal",
    "img": "lighthouse-park.jpg",
    "latitude": "49.3316",
    "longitude": "-123.2636",
    "name": "Lighthouse Park",
    "region": "The North Shore",
    "season": "Year-round",
    "time": "2",
    "toilets": "Lighthouse Park has washroom facilities in one of the buildings near the lighthouse.",
    "transit": "Yes"
  },
  {
    "id": "lindeman-lake",
    "camping": "Yes",
    "description": [
        "Far away from the busy shores of Cultus Lake is the much less used Chilliwack Lake area. One of the main hikes in this area starts from just under a kilometer from the end of the paved road and takes you uphill to the peaceful Lindeman Lake and Greendrop Lake.",
        "Look for a sign at the side of the road that says \"Post Creek, Lindeman, Greendrop, and Flora Lakes\". Park along side the road and start the trail from the yellow gate. Continue down the dirt access road to Post Creek. To the right of Post Creek is a sign pointing the way to Lindeman and Greendrop Lakes. Follow this trail as it heads into the trees for a short distance before starting to ascend. At the half-kilometer mark, you will come to a log bridge that was built from a fallen tree. Cross over Post Creek and continue hiking uphill.",
        "Just past the 1km mark, you will see a rockslide that fell many years ago. Another short distance and you've reached the first viewpoint from the south end of Lindeman Lake. Continue along the west shore of Lindeman Lake to a sandy beach area.",
        "The beach area of Lindeman Lake offers a perfect location to end your hike however, for those inclined to continue to Greendrop Lake, continue along the trail towards a boulder field. Watch your step as you traverse the large rocks. Once at the 4km mark, cross over a couple of log bridges and it's only another half hour to Greendrop Lake.",
        "Take a break at the lake before heading back towards Lindeman Lake and the Post Creek parking area."

    ],
    "difficulty": "Medium",
    "distance": "3.4",
    "dogFriendly": "Yes",
    "dogs": "Dogs are allowed around Lindeman Lake but must be kept under control at all times. Use caution at the far end of the lake as the rockslide area can be difficult for dogs to cross. Please pick up after your dog and pack out and dispose of all waste so it does not attract bears and other wildlife.",
    "drivingInstructions": [
        "Lindeman Lake is located near Chilliwack Lake east of Vancouver. To reach the trailhead, take Highway #1 (Trans Canada Highway) eastbound for about 75km to Exit #104. Follow this exit and turn right onto No. 3 Road. At Tolmie Road, turn right and immediately turn left back onto No. 3 Road. Follow No. 3 Road as it veers to the right and eventually comes to Yarrow Central Road. Turn left onto Yarrow Central Road and continue as it turns into Vedder Mountain Road. When you reach a bridge with a stop sign on the other side, turn right onto Chilliwack Lake Road. Follow Chilliwack Lake Road for the next 40km or so until just before the paved road becomes gravel. A sign on the right side of the roads points to the Lindeman Lake trailhead which begins on the leftside."
    ],
    "drivingTime": "2 hours 15 minutes",
    "gain": "300 m",
    "img": "lindeman-lake.jpg",
    "latitude": "49.1151",
    "longitude": "-121.4568",
    "name": "Lindeman Lake",
    "region": "Fraser Valley East",
    "season": "May - October",
    "time": "2",
    "toilets": "A pit toilet is located at the Lindeman Lake camping area. There are also washroom facilities beyond the trailhead at Chilliwack Lake.",
    "transit": "No"
  },
  {
    "id": "lions-bay-loop",
    "camping": "No",
    "description": [
        "The Lions Bay Loop starts from the General Store and Cafe and follows several hiking trails, passing Crystal Falls and viewpoints of Howe Sound. The trails that make up the loop include the Centennial Trail, the Crystal Falls Trail, the Soundview Trail, and the Harrison Trail, before returning to the start on the Centennial Trail.",
        "The trailhead is located on the other side of Centre Road by the Lions Bay General Store and Cafe, to the right of the wall that separates the Sea To Sky highway. Before setting off on your hike, make sure you have checked the parking signage to avoid being towed. Do not park in the General Store and Cafe parking lot.",
        "Follow the Centennial Trail next to the wall as it almost immediately crosses a metal bridge over Alberta Creek before continuing along a wide section of trail. The trail then enters the forest and begins to climb gradually as you continuing hiking parallel to the highway but higher above. The forest is beautiful through this section and as you continue hiking along the Centennial Trail, go left at each of the junctions to see the varying views of Howe Sound. The most interesting of all of the views is Arbutus Point, where a short 30 meter trail leads to a picnic table and a view out to Howe Sound. A sign sits there identifying the different islands and mountain ranges.",
        "Back on the trail, continue hiking as it keeps gradually ascending until you reach a junction with the Harrison Trail. You will return to this point after completing the loop but, for now, go left and down the wooden stairs as the trail descends quickly. Pass through several switch backs and over a small creek before the trail exits the forest onto a road.",
        "Cross the road and walk into what looks like an old, gravel parking area. Walk towards the right of the gravel area and a trail continues in the open above the Sea To Sky highway. Despite all of the noise of the passing traffic, the view of Howe Sound is great along this stretch. Continue walking along the gravel path until you reach the end at a road called Crystal Falls Road."
    ],
    "difficulty": "Easy",
    "distance": "4.5",
    "dogFriendly": "Yes",
    "dogs": "Dogs are allowed on the trails around Lions Bay but please keep dogs under control and pick up after them.",
    "drivingInstructions": [
        "The Lions Bay Loop begins across the street from the Lions Bay General Store and Cafe. To get to the trailhead from downtown Vancouver, drive along Georgia Street and continue through through the Stanley Park Causeway, crossing the Lions Gate Bridge. Stay to the left and enter West Vancouver. At the first set of traffic lights, turn right onto Taylor Way and drive up the street hill towards Highway #1. As you approach the overpass near the top, merge into the left lane, turn left at the highway entrance and following Highway #1 westbound.",
        "Watch for signs to the Sea To Sky Highway (Highway #99) North as you approach Horseshoe Bay. Stay to the left as you merge onto Highway #99 heading North. After driving about 24km, take the Lions Bay Avenue exit and drive up the hill to the right as you exit. Turn left at the first street, called Cross Creek Road, and drive across the small bridge, following the road until you reach a stop sign. The trailhead begins just down the road to the left. Parking is available on the south side of Centre Road. If you are unable to find any parking spots, there are several more about 100 meters up the road near the firehall.",
        "Please double check the signage when you are parking and do not park in the parking lot for the Lions Bay General Store and Cafe. If both street parking options are full, there is parking further up the hill by the school. You can access the Centennial Trail from the school by walking about 40 meters up the road from the school and following a dirt path that goes downhill to the right of a creek. This dirt path will join with the Centennial Trail."
    ],
    "drivingTime": "40 Minutes",
    "gain": "175 m",
    "img": "lions-bay-loop.jpg",
    "latitude": "49.4592",
    "longitude": "-123.2341",
    "name": "Lions Bay Loop",
    "region": "Howe Sound",
    "season": "Year-round",
    "time": "2",
    "toilets": "There are no toilets located on the hiking trails. Bathrooms are available for customers at the Lions Bay General Store and Cafe, across the street from the start of the trail.",
    "transit": "Yes"
  },
  {
    "id": "lynn-loop",
    "camping": "No",
    "description": [
        "Lynn Headwaters Regional Park has many trails that offer a variety in choosing shorter hikes to longer day hikes. Lynn Loop is a short trail that takes you up through the forest before looping back along the rushing water of Lynn Creek.",
        "From the parking lot, walk past the yellow gate towards Lynn Creek and over the bridge. Take in the rushing water below with Mount Fromme towering in the backdrop before continuing towards the signboard. Check the map of the park area and familiarize yourself with where you are and where the Lynn Loop Trail is.",
        "Head to the right along the service road until you reach a sign on your left marking the Lynn Loop Trail. Turn left and continue past the sign as you make your way up the steep hill. After walking uphill for about 10 minutes, the trail levels out and wanders through a forest filled with Cedar and Hemlock trees.",
        "On this trail you will pass a sign for a lookout. This section goes uphill for 10 minutes to a small view, from the top of a big rock, of Vancouver Island and some of the San Juan and Gulf Islands. Go back down to go return to the Lynn Loop Trail.",
        "Continue along the trail as it meanders through the forest, past mossy stumps and beautiful trees. After 2km, you will reach a fork in the trail known as the Second Debris Chute. At this point, if you wish to extend your hike by an additional 4.5km, continue right along the trail to the Third Debris Chute. Otherwise, head left down the hill towards the rushing water sound of Lynn Creek. The result of big windstorms can be seen along the way as evidenced by big piles of logs that have snapped and fell down."
    ],
    "difficulty": "Easy",
    "distance": "5.1",
    "dogFriendly": "On-Leash",
    "dogs": "Dogs must be on-leash at all times on the Lynn Loop trail and within Lynn Headwaters Regional Park. Please pick up after your dog and dispose of all waste in designated, bear proof garbage bins.",
    "drivingInstructions": [
        "Lynn Loop is located in Lynn Headwaters Regional Park in North Vancouver. To reach the start of the trail, take Highway #1 to the Lynn Valley Exit and follow Lynn Valley Road northbound. Continue past the shopping center and past the turnoff to Lynn Canyon Park. Where the road turns left, continue going straight along the narrow road to the last parking lot. If there is no parking here, backtrack about 500m to the overflow lot and walk back to the main parking lot"
    ],
    "drivingTime": "40 Minutes",
    "gain": "160 m",
    "img": "lynn-loop.jpg",
    "latitude": "49.3608",
    "longitude": "-123.0303",
    "name": "Lynn Loop",
    "region": "The North Shore",
    "season": "Year-round",
    "time": "1.5",
    "toilets": "Washroom facilities are located near the parking area before crossing the bridge.",
    "transit": "Yes"
  },
  {
    "id": "lynn-peak",
    "camping": "No",
    "description": [
        "The trail to Lynn Peak is a challenging hike in Lynn Headwaters Regional Park but the view from the top makes the climb worth the hard work. Lynn Peak is sometimes compared to the Grouse Grind as it offers a great cardio workout but is much less crowded.",
        "From the parking area, walk towards and cross Lynn Creek to where a signboard is on the other side with a map of the area. Go right and follow the wide gravel road for less than 10 minutes until you reach a sign marking the start of Lynn Loop on your left. The trail to Lynn Peak starts on the Lynn Loop route, so walk past the sign and follow the trail as it quickly heads uphill.",
        "Shortly after the trail levels and crosses a wooden boardwalk, a sign marking the junction to Lynn Peak appears. Go right and begin climbing uphill to Lynn Peak. The trail is quite rocky in sections, so watch your step as many of the rocks can easily be knocked loose causing an injury.",
        "The trail makes its way through the second-generation growth forest, ascending quickly. After walking for about 40 minutes, a small view of Seymour Mountain appears on the right, much of which has grown over. Continue hiking uphill as the trail begins to level and heads through some sections with flatter grades.",
        "Another 30-40 minutes later, you reach a viewpoint with a much clearer view of Seymour Mountain and the red radio towers that broadcast to Vancouver. Enjoy the view before continuing up the rocky trail as the grade steepens once again. About 20 minutes further, there is a viewpoint on the left that is sometimes easy to miss. It looks over to the west towards Grouse Mountain and on a clear day, out into the Georgia Strait. From this point, it is just a short uphill section and a final short, steep climb that brings you to the most spectacular view of the day at Lynn Peak. The viewpoint looks out towards Seymour. The city and as far away as the USA can been seen on a sunny, clear day. Find a place along the rocks to sit and soak in the view before heading back."
    ],
    "difficulty": "Medium",
    "distance": "9",
    "dogFriendly": "On-Leash",
    "dogs": "Dogs are allowed but must be leashed. Please ensure that you pick up after your dog to prevent wild animals being attracted to the area.",
    "drivingInstructions": [
        "Lynn Loop is located in Lynn Headwaters Regional Park in North Vancouver. To reach the start of the trail, take Highway #1 to the Lynn Canyon Exit and follow Lynn Valley Road northbound. Continue past the shopping center and past the turnoff to Lynn Canyon Park. Where the road turns left, continue going straight along the narrow road to the last parking lot. If there is no parking here, backtrack about 500m to the overflow lot and walk back towards the overflow parking lot."
    ],
    "drivingTime": "40 Minutes",
    "gain": "720 m",
    "img": "lynn-peak.jpg",
    "latitude": "49.3736",
    "longitude": "-123.0216",
    "name": "Lynn Peak",
    "region": "The North Shore",
    "season": "June - October",
    "time": "4",
    "toilets": "Washroom facilities are located near the parking area before crossing the bridge over Lynn Creek. There are no facilities along the trail to Lynn Peak.",
    "transit": "Yes"
  },
  {
    "id": "mount-gardener",
    "camping": "No",
    "description": [
        "From the ferry terminal on Bowen, head up the main road and turn right on Cardena Road. A few hundred meters along the road on the left is a parks sign for Crippen Regional Park. Follow this trail and turn right at the first 4-way intersection and continue until you reach Miller Road. Cross the road and continue along the trail for another 15 minutes until you reach the end. Turn right to go to Killarney Lake.",
        "The trail becomes a wide-open meadow. Continue through the meadow and back into the forest. At the end of this section, turn left at the sign to Killarney Lake. A few minutes later you reach a fork and take the left trail. Shortly after this, you should see the lake.",
        "Turn left at the lake and then right immediately after to follow the path along the shore of the lake. After walking for 10 minutes, watch for a trail on your left that is steep (if you reach a bridge across marshy swamp, you have gone too far). Follow this short trail up to the road and turn right walking along the side of the road for 5 minutes. The first street on your left is called Hikers Trail Road. Follow this road uphill to the metal gate marking the start of the trail to Mount Gardner.",
        "Continue uphill past the metal gate until you reach the Skid Trail on your left a short distance later. Follow this trail as it winds through a forested area, making its way uphill. After 20-30 minutes of climbing, the trail forks. Go right towards the gravel road and walk a short distance up the road. On your right, after the steep corner, the trail branches off. Leave the road and follow the trail."
    ],
    "difficulty": "Medium",
    "distance": "17",
    "dogFriendly": "Yes",
    "dogs": "Dogs are allowed on Mount Gardner but should be on a leash at all times. Access to the north peak from the trail on the north side requires the use of the rope that is in place there to pull yourself up through this steep section. Dogs are unable to pass through this part of the trail however, they can access the north peak from the trail on the south side which is much easier. Please pick up after your dog. Remember to pack out and properly dispose of all waste so it does not attract wildlife.",
    "drivingInstructions": [
        "Mount Gardner is located on Bowen Island, a 20-minute ferry ride from Horseshoe Bay. From the ferry terminal on Bowen Island, it’s approximately 3km to the trailhead. It is recommended to park your car at Horseshoe Bay and either walk or bring a bike to ride the first 3km to the trailhead.",
        "Check the ferry schedule with BC Ferries before leaving.",
        "To reach Horseshoe Bay, drive west on Highway #1 (Trans Canada Highway) and watch for a turnoff to the village. Park in the pay parking lot near the ferry terminal and take the scenic 20-minute ferry ride to Snug Cove on Bowen Island."
    ],
    "drivingTime": "45 Minutes to Ferry / Horseshoe Bay",
    "gain": "719 m",
    "img": "mount-gardener.jpg",
    "latitude": "49.3766",
    "longitude": "-123.3908",
    "name": "Mount Gardener",
    "region": "Howe Sound",
    "season": "Year-round",
    "time": "7",
    "toilets": "There are no toilets along the Mount Gardner trails. There are washroom facilities at several points along Killarney Lake which is close-by.",
    "transit": "Yes"
  },
  {
    "id": "mount-seymour",
    "camping": "No",
    "description": [
        "One of the local Vancouver ski hills in the winter, the summer hike wanders up the mountain, passing over a couple of peaks before reaching a panoramic view of the city and the Coastal Mountain Range.",
        "From the end of the parking lot next to the BC Parks sign board, walk towards the ski run and follow it uphill to a green sign on the left. The first trail goes to Dog Mountain, another scenic and shorter hike then Mount Seymour. Instead, follow the trail that heads uphill and parallel to the ski run. The trails on the mountain are well marked with signs at junctions that have accurate distances to each destination.",
        "The trail climbs quickly and steadily away from the parking area. Go right at the first junction and then right at a second junction as you pass alongside wild foliage and over small wooden bridges. The trail eventually reaches what looks like a dirt road but is actually a ski run in the winter. Go left at this point and continue up the wide gravel path staying on the middle route. Do NOT follow the path to the right that goes up a steep hill.",
        "About a couple of hundred meters up the wide path, another green sign appears with an arrow and distance to Mount Seymour. Go left and walk down the slight hill, past the pool of water on the right and continuing your ascent up a rocky hill. You will reach another junction with a sign. Go left over the rock and continue following the trail as it briefly descends. Make sure to take an opportunity once in awhile to look around at the surrounding views as the scenery varies from views of the city, nearby mountains, and even spectacular rock slides that occurred over thousands of years next to the trail.",
        "The final junction marks the trail to Elsay Lake on your right and Mount Seymour to the left. Go left and up the steep hill as the trail weaves around rocks before reaching a short 400 meter trail on the left to First Peak. Go left for a short side trip and climb up onto the highest point for an incredible view of the city on a sunny, clear day.",
        "Back at the main trail, walk past the green marker and watch for orange markings on the rocks ahead. The trail veers slightly to the right, over the rocks and not straight down as the path would seem. The orange paint on the rocks can be worn in areas and hard to see but it?s there and frequent enough to follow, so just keep an eye out for it. The trail descends before heading up another steep slope with lots of loose rock."
    ],
    "difficulty": "Medium",
    "distance": "9",
    "dogFriendly": "Yes",
    "dogs": "Dogs must be on a leash at all times on Seymour Mountain hiking trails. Please pick up after your dog and dispose of all waste in designated bear proof garbage bins. Be advised that there are some steep dropoffs and cliffs on the trail to Mount Seymour which may be difficult for some dogs. Keep your dog under control and do not attempt something that may put your pet or yourself in danger.",
    "drivingInstructions": [
        "The trail to Mount Seymour is accessible from the downhill ski area parking lot at Seymour in North Vancouver. To reach the parking lot, drive east to the Trans Canada Highway (Highway #1) and enter the highway heading westbound. Continue across the Iron Workers Memorial Bridge (Second Narrows) and take Exit #22, Mt. Seymour Parkway, shortly after crossing the bridge. At the set of lights, turn right onto Mt. Seymour Parkway and continue along the parkway for about 4km until you reach the traffic lights and small shopping area at Mt. Seymour Road. Turn left onto Mt. Seymour Road and continue straight as the road begins to climb up Mount Seymour for the next 13km. Park at the far end of the parking lot near a wooden signboard with a map of the area. Don't forget to buy a parking ticket."
    ],
    "drivingTime": "50 Minutes",
    "gain": "450 m",
    "img": "mount-seymour.jpg",
    "latitude": "49.3933",
    "longitude": "-122.9444",
    "name": "Mount Seymour",
    "region": "The North Shore",
    "season": "July - October",
    "time": "5",
    "toilets": "Toilets are located near the parking lot of the Seymour Mountain ski area.",
    "transit": "No"
  },
  {
    "id": "othello-tunnels",
    "camping": "Yes",
    "description": [
        "The Othello Tunnels are a series of old train tunnels and bridges that cut through the solid granite walls and pass over the wild Coquihalla River. The tunnels are located just east of the town of Hope, BC, in the Coquihalla Provincial Park and the trail is a short, flat 3.5km return route.",
        "In the early 1900's, the Canadian Pacific Railway decided to connect the southern coast of British Columbia with the Kootenays and it was determined the best option was a route through the Coquihalla Gorge. Today, the route no longer has railway tracks and has been restored as part of the Kettle Valley Railway Trail, a popular cycling route that follows the old train routes over trestles and through tunnels and is noted for it's gradual change in elevation.",
        "The Coast Mountain Range proved quite a challenge to build a railway through and walking over the bridges in the Othello Tunnels area, it becomes quite evident how difficult it must have been. The sheer rock cliffs, the violently rushing water below, and the remoteness makes it seem incredible that any infrastructure could be built in such an environment, let alone over 100-years ago with limited engineering equipment.",
        "From the parking lot, follow the signs along the wide trail near the Coquihalla River. The former railroad bed is flat and an easy walk for families of all ages. Not far along, the first tunnel can be seen ahead as you follow the trail into the dark tunnel. The trail briefly exits the tunnel before entering tunnel #2.",
        "After existing tunnel #2, the route crosses a bridge where the Coquihalla River rages through the rocky canyon below. Continue walking through tunnel #3 to another bridge with views of the canyon. After walking through tunnel #4, the Othello Tunnels route abruptly ends, although the trail keeps going all the way to the town of Hope. At the end of the tunnels is the turnaround point where visitors walk back through the same tunnels, returning to the parking lot.",
        "One other piece of history, due to the canyon's rugged look, the park has made several appearances in popular films over the years. The most notable was Rambo First Blood where the cliff above Tunnel #2 was used in the spectacular cliff jump scene. Other movies that filmed scenes around Othello Tunnels include Fire With Fire, The Adventures of Yellow Dog, and Shoot To Kill."
    ],
    "difficulty": "Easy",
    "distance": "3.5",
    "dogFriendly": "On-Leash",
    "dogs": "Dogs are allowed on the hiking trail at Othello Tunnels but must be kept on a leash at all times. Please make sure to pick up after your dog.",
    "drivingInstructions": [
        "The easiest route to drive to the Othello Tunnels is to take Exit #183 Othello Road from the Coquihalla Highway. The turnoff is located about 6km east of the junction to the Crowsnest Highway (Highway #3) along Coquihalla Highway (Highway #5).",
        "Once you have turned off the highway, the road passes underneath the highway and continues along Othello Road westbound, back towards Hope. Follow this road for about 3km and watch for signs to Coquihalla Provincial Park that point to the left onto Tunnel Road. Drive into the park and park in the designated parking lot."
    ],
    "drivingTime": "2 hours 15 minutes",
    "gain": "Minimal",
    "img": "othello-tunnels.jpg",
    "latitude": "49.3778",
    "longitude": "-121.3695",
    "name": "Othello Tunnels",
    "region": "Fraser Valley East",
    "season": "May - October",
    "time": "1.5",
    "toilets": "Pit toilets are located at the parking lot area for Othello Tunnels. No toilets are located along the trail.",
    "transit": "No"
  },
  {
    "id": "panorama-ridge",
    "camping": "Yes",
    "description": [
        "The views from Panorama Ridge are some of the most scenic views in the Garibaldi Provincial Park area. Located on the opposite end of the campsite, high above Garibaldi Lake, Panorama Ridge offers a full panoramic view of Garibaldi Lake, Black Tusk, and the Helm Lake area.",
        "While many hikers do complete this trail in a day, the distance and elevation gain to Panorama Ridge make for a very long day. For this reason, some people prefer to hike to Garibaldi Lake or Taylor Meadows and camp overnight, before completing the hike to Panorama Ridge the following day. It is up to you which you prefer however, if you do decide to do this in a day make sure to leave plenty of time to return to the parking lot during daylight hours.",
        "From the top section of the Rubble Creek parking lot near the wooden steps, enter the forest along the gravel trail and begin your hike. For the next 6km, the trail climbs gradually through a series of switchbacks and second growth forests. Shortly after the 6km marker, the trail reaches a junction with a map of the area. Take the trail to the left and head towards Taylor Meadows.",
        "Another 20 minutes or so of gradual uphill and the trees begin to thin as you enter into the meadows. During the late summer or early fall, Taylor Meadows is full of bright colours from the alpine flowers that are blooming. It is important to stay along the trail in this ecologically sensitive area as some of the flowers and vegetation can take years to regrow if damaged from hikers.",
        "Continue along the path as just a short distance later you arrive at the Taylor Meadows campsite. Look up and to your left for a view of Black Tusk towering high above. It's inviting however, this hike will be saved for another day.",
        "Keep continuing straight along the trail as it wanders through the meadows, occasionally looking back to catch glimpses of the snowcapped mountains behind you. Another 20 minutes or so of gradual uphill through the meadows and you arrive at the Black Tusk junction. Continue heading straight towards the Panorama Ridge junction as the trail continues alongside a slope that trickles with little streams flowing amongst the colourful flowers. As you pass through this area, observe the meadows below and the occasional rock that has slid down the hill and is now resting among the green foliage.",
        "Eventually, the trail reaches the Panorama Ridge junction where a scenic view of Helm Lake lies off to the left. Continuing along that trail would eventually bring you to Cheakamus Lake. However, this route is better done by performing a car-swap whereby one hiking party parks a car at Rubble Creek, and another hiking party parks a car at Cheakamus Lake, then both parties hike and meet at about the midpoint of the trail where car keys are exchanged before continuing along their routes to the opposing parking lots. Instead, follow the route to Panorama Ridge by continuing to the right of the junction, heading down a slight slope before veering to the left and beginning a climb through the alpine vegetation.",
        "The climb becomes steeper and steeper the further you continue. Enjoy the gradual climb as the steepest section is yet to come. The trail snakes up the side of the hill, eventually onto a ridge where the vegetation starts to thin and the terrain eventually becomes all rocks.",
        "Scramble up the rocky slopes using your hands for extra help and being careful of the occasional loose rock. The trail is not marked as obvious through this area, however occasional markings and obvious wear from all the hikers lead the way to the top. The steep section can be quite grueling but keep in mind the payoff at the end is extremely rewarding. After scrambling for what seems an eternity, the trail begins to level and the turquoise colour of Garibaldi Lake appears below. At this point, you have reached your destination. The Black Tusk and Helm Lake areas lie behind and even a glimpse of the glacier next to Garibaldi Lake is visible off in the distance."
    ],
    "difficulty": "Hard",
    "distance": "30",
    "dogFriendly": "No",
    "dogs": "Dogs are NOT allowed at Panorama Ridge or on any of the other trails in Garibaldi Provincial Park.",
    "drivingInstructions": [
        "To reach the Rubble Creek parking lot, the start of the trail to Panorama Ridge via the Garibaldi Lake area, take Highway #1 (Trans Canada Highway) west towards Horseshoe Bay. Just before the ferry terminal, watch for signs to Squamish and merge onto Highway #99 (Sea to Sky Highway) northbound. Continue driving along the highway until reaching the town of Squamish 45km later. At this point, it's a good idea to make sure you have enough gas, water, and food for the day as there are no other places to stop between here and the trailhead.",
        "Continue along Highway #99 northbound towards Whistler for another 32km. Watch for Garibaldi Provincial Park signs on your right. The turnoff is a small, paved road on the right of the highway that is easy to miss. If you pass over a bridge with a large dam on the right, you have just passed it and will have to find a place to turn around and head back.",
        "Once on the Rubble Creek Road, continue for a couple of kilometers until you reach the parking lot."
    ],
    "drivingTime": "1 hour 45 minutes",
    "gain": "1520 m",
    "img": "panorama-ridge.jpg",
    "latitude": "49.9681",
    "longitude": "-123.0152",
    "name": "Panorama Ridge",
    "region": "Whistler",
    "season": "July - October",
    "time": "11",
    "toilets": "Pit toilets are located at several points along the route to Panorama Ridge including at the Rubble Creek parking lot, Taylor Meadows campsite, the Black Tusk junction, and Garibaldi Lake.",
    "transit": "No"
  },
  {
    "id": "quarry-rock",
    "camping": "No",
    "description": [
        "Just off the shores of scenic Deep Cove in North Vancouver sits a large rocky outcrop known as Quarry Rock (also known as Grey Rock in some hiking books). A hiking trail which is also part of the easternmost section of the Baden Powell Trail, leads to this point offering scenic views of Indian Arm and the mountains around Belcarra.",
        "The start of the Baden Powell Trail begins along Panorama Drive just beyond the park area. Look for the sign on the left side of the street and walk up the edge of the driveway towards the wooden steps. The first section of the trail climbs quickly up the set of stairs and then up and over the maze of tree roots.",
        "The terrain is typical of North Shore hikes; densely wooded areas of Douglas Fir and Hemlock trees, small creeks from mountain runoff, and the smell of fresh forest air. Continue over the small wooden bridge as the trail begins to level.",
        "After 30 minutes, the trail heads down towards a large wooden bridge. Cross the bridge and ascend up a set of wooden stairs on the other side. Another 10 minutes and you reach a fork in the trail where the left side goes up a steep embankment. Go right towards the clearing in the trees as the trail climbs up onto the solid rock. You have arrived at the Quarry Rock. Climb up to the highest point to check out the view before staking out a spot to sit and relax.",
        "On a warm, clear day, one could sit for hours enjoying the tiny boats below and scenic surroundings off in the distance. When it comes time to return, head back towards the clearing and back along the trail as it weaves through the forest and back towards Deep Cove."
    ],
    "difficulty": "Easy",
    "distance": "3.8",
    "dogFriendly": "Yes",
    "dogs": "Dogs are allowed to be off-leash but under control at all times. Be cautious at the viewpoint to Quarry Rock as there have been reports of dogs becoming stranded on the rocks as they managed to climb down to other rocks below. Please pick up after your dog and take all waste back to the Deep Cove area to dispose in bear proof garbage bins.",
    "drivingInstructions": [
        "Head eastbound towards Highway #1 (Trans Canada Highway) and enter the highway heading northbound. Cross the Iron Workers Memorial Bridge, also known as the Second Narrows. Take the third exit (Exit #22) after the bridge towards Mount Seymour Parkway. After exiting the highway, stay in the right lane and immediately turn right at the lights onto Mount Seymour Parkway. Follow Mount Seymour Parkway for 5km until a traffic light at the bottom of a steep hill. Turn left onto Deep Cove Road and drive for a few minutes towards the community of Deep Cove. At the 4-way stop, turn left onto Panorama Drive and park in the parking lot. The trailhead begins along Panorama Drive past the park."
    ],
    "drivingTime": "30 minutes",
    "gain": "100 m",
    "img": "quarry-rock.jpg",
    "latitude": "49.3302",
    "longitude": "-122.9498",
    "name": "Quarry Rock",
    "region": "The North Shore",
    "season": "Year-round",
    "time": "1.5",
    "toilets": "There are no toilets along the trail to Quarry Rock. There are washroom facilities near the beach area at Deep Cove.",
    "transit": "Yes"
  },
  {
    "id": "st-marks-summit",
    "camping": "No",
    "description": [
        "St. Mark’s Summit is part of the Howe Sound Crest Trail that spans over 30km from Cypress to a point along the Sea to Sky Highway near Porteau Cove. The section of the trail that St. Mark’s Summit is on starts from Cypress Mountain which is the first mountain along this route and offers spectacular views of Howe Sound on a clear day.",
        "From the Cypress Mountain downhill parking lot, head north towards the nearby chairlift and look for the Howe Sound Crest Trail sign. The trail follows alongside the several ski runs until a sign that points to the right to the Howe Sound Crest Trail. Follow this trail uphill until it merges onto a wider ski run and veer to the left towards a large green water tower. Just before the tower, go right onto a trail and walk uphill through the trees.",
        "After a short hike, the trail reaches a gravel road. Go left at the gravel road and continue as a short distance later the road narrows and becomes a trail. You are now on the Howe Sound Crest Trail and this route will take you to St. Mark’s Summit. About 10 minutes after entering the forest, you reach a junction with a map of the area. Just beyond the mapboard is a clearing with a view of the Lions off in the distance. Continue along the trail as it winds along the mountainside and gradually heads uphill.",
        "The trail emerges briefly into a small meadow and crosses two bridges before continuing uphill. A few minutes later, the climb begins to steepen as the trail goes through a series of switchbacks. The path then begins to level and a brief downhill section along the top of the ridge offers some relief from the steep hill on a warm day. The relief is short lived as the trail climbs again through another series of switchbacks that are steeper than the previous ones.",
        "As the trail levels out, you have reached the upper region of St. Mark’s Summit. Continue another short distance over the rocky terrain until you reach a point where you can see Unnecessary Mountain and the Lions off in the distance. Do not descend but instead, go left to a scenic viewpoint of the area. On a clear day, you can see views of Howe Sound, the Tantalus Range, and even the Gulf Islands and Vancouver Island off in the distance. There are a few other viewpoints along the short ridge that are worth checking out before making your journey back towards Cypress Mountain."
    ],
    "difficulty": "Medium",
    "distance": "11",
    "dogFriendly": "On-Leash",
    "dogs": "Dogs are allowed on the Howe Sound Crest Trail but must be kept on a leash at all times. It should be noted that some sections of trail beyond St. Mark’s Summit towards the Lions are very rocky and difficult for dogs which can put both you and your dog in danger. It is best to NOT take dog beyond St. Mark’s Summit. Please pick up after your dog and pack out all waste to be disposed of as there are no garbage facilities along the trail.",
    "drivingInstructions": [
        "St. Mark’s Summit starts from the northernmost parking lot at Cypress Mountain. Follow Highway #1 westbound and take Exit #8 to Cypress Provincial Park. Stay on Cypress Parkway as it heads uphill and continue to the left to the northern (downhill ski area) parking lot."
    ],
    "drivingTime": "45 Minutes",
    "gain": "460 m",
    "img": "st-marks-summit.jpg",
    "latitude": "49.4343",
    "longitude": "-123.2110",
    "name": "St. Mark’s Summit",
    "region": "The North Shore",
    "season": "July - October",
    "time": "5",
    "toilets": "There are washroom facilities at Cypress Mountain but no toilets along the Howe Sound Crest Trail.",
    "transit": "No"
  },
  {
    "id": "stanley-park",
    "camping": "No",
    "description": [
        "The world-famous Stanley Park is one of the major attractions for tourists when they visit Vancouver. Located next to the downtown core, Stanley Park is full of trails for walking and biking and has numerous scenic views from English Bay to the inner harbour.",
        "Despite being located in a major city, you can take one of the many networks of trails and still feel as though you’re away from all the hustle and bustle of the city life. There are many routes through the park and the best opportunity for planning your trip is to look at a map to determine your route. However, for this description, we will start near the Rose Garden and bus loop, a central area of the park.",
        "From the gardens, walk across the Pipeline Road and along the South Creek Trail. The thick green forest is lined with Cedar, Hemlock, and Douglas Fir trees. At the junction go right and then a short distance later right again and head around Beaver Lake as it rounds the lake in a counterclockwise direction.",
        "Stop to look at the different species of ducks living in the lake. Occasionally, a long-legged heron can be seen walking through the shallow lake looking for fish. Continue around the lake and veer off onto the Lake Trail as it becomes paved. The sound of cars can be heard ahead as you reach an overpass that crosses over the Stanley Park Causeway that connects the downtown core with the North Shore via the Lions Gate Bridge.",
        "After crossing over the causeway, go right and along the Bridle Path as the sound of traffic weakens. Pass the first junction but go left on the second junction and onto the Rawlings Trail. The park is home to many squirrels and birds that are often visible as you walk through the forest."
    ],
    "difficulty": "Easy",
    "distance": "6.5",
    "dogFriendly": "On-Leash",
    "dogs": "Dogs are allowed on-leash on most trails in Stanley Park but please watch for signs that do not allow for dogs and avoid those trails. Please pick up after your dog and dispose of all waste in designated garbage bins throughout the park.",
    "drivingInstructions": [
        "Stanley Park is located right next to Vancouver’s downtown core. There are many different starting points and routes to walk around the park however, we’ll begin the walk from the Rose Garden near the bus loop. This location has parking nearby and is also accessible by bus and within walking distance from downtown."
    ],
    "drivingTime": "10 Minutes",
    "gain": "Minimal",
    "img": "stanley-park.jpg",
    "latitude": "49.3017",
    "longitude": "-123.1417",
    "name": "Stanley Park",
    "region": "Vancouver City",
    "season": "Year-round",
    "time": "2",
    "toilets": "There are numerous washroom facilities throughout Stanley Park. Refer to the maps located along the trails for the locations of the washrooms.",
    "transit": "Yes"
  },
  {
    "id": "stawamus-chief",
    "camping": "Yes",
    "description": [
        "The Chief towers high above the town of Squamish and is a popular hiking destination that offers scenic views of Howe Sound and several mountains in Garibaldi Provincial Park. Hikers can complete all three peaks of the Chief in a day or just choose to do a shorter trip to the South Peak that still offers a spectacular view.",
        "From the Shannon Falls parking lot, head into the park and go left up the wide gravel road towards the stream. Another 100 meters up a few stairs brings you to the main lookout point of Shannon Falls where the water tumbles from more than 330 meters above. This spectacular waterfall is very popular among tourists and can be very crowded on a hot, sunny day.",
        "After enjoying the view, it’s time to begin the hike to the top of the Chief. Head in the opposite direction of the falls to a clearing in the trees and go right along a dirt trail. The trail gradually begins to climb and eventually crosses Olesen Creek before joining the trail to the Chief. Turn right and head up the stairs.",
        "The next 30 to 45 minutes is spent climbing steadily uphill over wooden steps and a well-worn dirt path. Upon reaching a junction, stay left and then go left after another 100 meters or so. Another 10 minutes or so brings you to a fork where you make the decision to head left to the South Peak or right to the Centre and North Peaks. All 3 peaks can be completed in roughly 5 hours but for those who want a shorter trip, the South Peak takes only about 3.5 hours. Either way, go left and continue uphill.",
        "A spectacular site lies ahead where a huge slab of granite hangs overtop of the trail. Walk up the stairs and just beyond this point the forest gives way to the exposed rock at the summit of the Chief. Use the chains and ropes to help pull your way up as you scramble for the summit. Be careful if the rock is wet as the moss can make it very slippery and dangerous."
    ],
    "difficulty": "Medium",
    "distance": "11",
    "dogFriendly": "On-Leash",
    "dogs": "While dogs are allowed on a leash at all times on the Chief, there are several sections with steep inclines, ladders, and narrow ledges that can pose a danger to your pet and yourself. Keep dogs on a leash at ALL times at the peaks and away from the edges as the drop-offs are sudden. Please pick up after your dog and pack out all waste to be disposed of in the garbage bins at the parking lot areas of the trail.",
    "drivingInstructions": [
        "The Chief is the towering mountain that overlooks the town of Squamish north of Vancouver. To get to the Chief, take Highway #1 westbound towards Horseshoe Bay and exit onto Highway #99 (Sea to Sky Highway). Continue along the highway for the next 30-40 minutes and then watch for the signs to Shannon Falls. Turn right at the traffic lights and parking in the Shannon Falls parking lot.",
        "Hikers can access the Chief from either Shannon Falls or the Stawamus Chief Provincial Park parking lot further along Highway #99. Parking at Shannon Falls gives you the added bonus of seeing the beautiful waterfall however, the parking lot is small and often full of tourists. If the lot is full, continue for another kilometer or so to the Chief parking lot just off to the right of the highway."
    ],
    "drivingTime": "1 Hour",
    "gain": "600 m",
    "img": "stawamus-chief.jpg",
    "latitude": "49.6866",
    "longitude": "-123.1349",
    "name": "Stawamus Chief",
    "region": "Howe Sound",
    "season": "March - November",
    "time": "6",
    "toilets": "There are toilets at both the Shannon Falls and the Chief parking areas.",
    "transit": "No"
  },
  {
    "id": "teapot-hill",
    "camping": "Yes",
    "description": [
        "The Teapot Hill Trail is located next to Cultus Lake and offers a short hike uphill with a view of the lake. Park in the Teapot Hill parking lot and start the hike heading uphill. After 100m, there is an outhouse and park map on your left.",
        "Continue heading up the service road, passing by a stream and groves of mixed deciduous and coniferous trees. After about 20-30 minutes, a sign will be posted that points to Teapot Hill off to the right. Continue along this path passing a sign that describes the area flowers that include Stinging Nettle, Western Columbine, Tiger Lily, and Trillium.",
        "A steep hill is an indicator that you are almost there. After ascending the hill, the trail levels out and you come to the first view of Cultus Lake. Stop to take it in briefly before continuing along the trail for another 100m to the second viewpoint that overlooks the lake and Columbia Valley towards the USA.",
        "Stop to have a break here or make your way back to the previous viewpoint before descending back down the hill towards the parking lot."
    ],
    "difficulty": "Easy",
    "distance": "5",
    "dogFriendly": "On-Leash",
    "dogs": "Dogs must be kept on a leash at all times on Teapot Hill and are not permitted in non-designated beach areas around Cultus Lake. Please pick up after your dog and dispose of all waste in designated garbage bins around the park.",
    "drivingInstructions": [
        "The hike to Teapot Hill is located in the Cultus Lake area in Chilliwack, BC. From Vancouver, drive east towards Highway #1 the Trans Canada Highway and enter the highway heading eastbound. Pass through Burnaby, Coquitlam, across the Port Mann Bridge and continue east through the Fraser Valley.",
        "Exit the Highway at Exit #104: No. 3 Road and turn right after exiting, following No. 3 Road eastbound. Turn right at Tolmie Road and then a quick left back onto No. 3 Road. At the end of No. 3 Road, turn left onto Yarrow Central Road and continue driving straight as it eventually turns into Vedder Mountain Road. Turn right onto the Columbia Valley Highway (also called the Cultus Lake Road) and follow this road into the Cultus Lake area. Continue along the lake and just past the Delta Grove Campground is a parking lot on your left where the trail to Teapot Hill begins."
    ],
    "drivingTime": "1 hour 40 minutes",
    "gain": "250 m",
    "img": "teapot-hill.jpg",
    "latitude": "49.0425",
    "longitude": "-121.9838",
    "name": "Teapot Hill",
    "region": "Fraser Valley East",
    "season": "Year-round",
    "time": "2",
    "toilets": "There is a pit toilet less than 30 seconds up the hill from the parking area. There are several washroom facilities throughout the Cultus Lake area.",
    "transit": "No"
  },
  {
    "id": "whistler-train-wreck",
    "camping": "No",
    "description": [
        "A part of Whistler's historical and cultural identity, the Train Wreck site is a popular attraction and is located near the Cheakamus River just south of Whistler. The short hiking trail follows the Sea To Sky Trail and crosses a suspension bridge, offering scenic views of the Cheakakmus River rushing below before arriving at the colourfully painted box cars, which have sat in the forest since 1956.",
        "To get to the Whistler Train Wreck, follow the trail at the side of Jane Lakes Road past the Sea To Sky Trail sign and into the forest. The majority of the trail to the Whistler Train Wreck site is easy, with a very short steep downhill near the suspension bridge but easy enough for all ages. The trail meanders along the gravel path through the lush forest.",
        "At a junction, go right following the signs to the Train Wreck and passing the skis on the tree. This section of trail has a lot of tree roots along the path, so be careful to watch your step. As the trail begins to slowly descend, the Cheakamus River comes into view between the trees. Continue down a short steep section before the trail veers right to the suspension bridge crossing the Cheakamus River.",
        "Enjoy the view of the rushing water in the canyon below as you cross the bridge. The suspension bridge was built in the summer of 2016 in response to people hiking to the train wreck along active train tracks by illegally trespassing on the railroad's property. The suspension bridge connects trails on the east and west side of the Cheakamus River.",
        "After crossing the suspension bridge, walk the short distance up the hill and you're in the middle of the train wreck site, with box cars on both sides of you. Take your time walking around and checking out the wreck and the ramps that have been built for mountain bikers.",
        "There are 2 additional box cars that many hikers miss that are a few minutes further south (downstream direction) from the group of box cars. The entire Train Wreck site consists of 7 box cars, all of which have been painted over the years and have become a popular tourist attraction.",
        "After enjoying the area, cross back over the suspension bridge and go right, following the trail up the steep section and back to the junction. Go left at the junction and walk the short distance back to the road where you parked."
    ],
    "difficulty": "Easy",
    "distance": "2",
    "dogFriendly": "On-Leash",
    "dogs": "Dogs are allowed on the trail to the train wreck along the Sea To Sky trail. Please ensure your dog is on a leash while crossing the suspension bridge and pick up and remove all dog excrement from the trail.",
    "drivingInstructions": [
        "The Whistler Train Wreck is located in Whistler near Function Junction, the furthest south traffic light in Whistler.",
        "From Vancouver, drive to Highway #1 and enter the highway heading Westbound. If you're driving from downtown, you'll need to cross the Lions Gate Bridge and exit towards West Vancouver, before turning right and driving up Taylor Way towards Highway #1.",
        "Follow Highway #1 west toward Horseshoe Bay and merge onto Highway #99 Northbound towards Squamish and Whistler. Drive the scenic route as it passes through Lions Bay, Britannia, Squamish, and eventually, Whistler.",
        "At the first traffic lights as you enter Whistler, known as Function Junction, turn right and drive east. Cross the small bridge and immediately turn right onto Jane Lakes Road. After turning right, drive about 500-meters to where there is a small road that branches to the left. The parking area is located to the left by this small road, next to a sign that reads “Train Wreck Parking”. The trail begins across the street next to a sign marking the Sea To Sky Trail."
    ],
    "drivingTime": "1 hour 30 minutes",
    "gain": "30 m",
    "img": "whistler-train-wreck.jpg",
    "latitude": "50.1163",
    "longitude": "-122.9573",
    "name": "Whistler Train Wreck",
    "region": "Whistler",
    "season": "May - November",
    "time": "1.5",
    "toilets": "There are no toilets located along the trail or at the Train Wreck site.",
    "transit": "No"
  },
  {
    "id": "whytecliff-park",
    "camping": "No",
    "description": [
        "Situated in the rugged coastline along the shores of Howe Sound in West Vancouver, the scenic mountains and passing boats offer spectacular views for visitors to Whytecliff Park to enjoy. Not only does Whytecliff Park have a series of hiking trails but you can also explore the beach and island area, have a family picnic in the park, or even scuba dive in what’s known as a famous area for underwater diving.",
        "The park is divided into two sections, with the upper section having the majority of hiking trails and being much quieter than the beach area. There are some short trails from the beach and along the shoreline edge near the main parking lot but if you want to explore the hiking trails, you will have to start from the top of the overflow parking lot.",
        "At the top of the overflow parking, a small trail climbs steeply into the forest. A short climb up the hill and there is an unmarked set of rock stairs on the right which are easy to miss. The viewpoint at the top of these stairs used to overlook Batchelor Bay but the trees have grown over the years to block this view.",
        "Back on the main trail and another short walk uphill, the trail forks at a fire hydrant into what is the first of a few loops. You will want to plan your route so that you take one part of the loop first and then return via the other part of the loop. Go left at the junction and up a short hill to where a bench sits overlooking Howe Sound and the passing ferry and sailboats below.",
        "Continue along the trail as it winds around the rock. Stay to the left and walk out onto a rocky clearing as it gradually descends before meeting up with another trail. Go left and continue your hike, staying left at the next two junctions and catching glimpses of the occasional view of Howe Sound."
    ],
    "difficulty": "Easy",
    "distance": "2",
    "dogFriendly": "On-Leash",
    "dogs": "Dogs are permitted in most areas of Whytecliff Park as long as they are on a leash and their owners pickup and depose of any dog droppings. There are a few areas have clearly marked signs where dogs are not allowed.",
    "drivingInstructions": [
        "Whytecliff Park is located along the western most shoreline of West Vancouver near Horseshoe Bay. From downtown Vancouver, drive to Georgia Street and head westbound as it merges onto the Stanley Park causeway before reaching the Lions Gate Bridge. After driving across the bridge, go straight towards West Vancouver, looping around the offramp before merging onto Marine Drive. Stay in the right lane and turn right at the first light and drive up Taylor Way. Drive under the highway overpass and turn left, taking Highway #1 westbound.",
        "Drive along the highway towards Horseshoe Bay and take exit #2 for Eagleridge Drive. Follow the road until you reach an overpass and turn left onto Marine Drive. At the roundabout, continue straight along Marine Drive and follow the road as it weaves through a residential area before reaching Batchelor Bay on the left. Continue a short distance further to the main parking lot on the left and the overflow parking lot just up the hill on the right."
    ],
    "drivingTime": "45 Minutes",
    "gain": "75 m",
    "img": "whytecliff-park.jpg",
    "latitude": "49.3731",
    "longitude": "-123.2885",
    "name": "Whytecliff Park",
    "region": "The North Shore",
    "season": "Year-round",
    "time": "1.5",
    "toilets": "Public toilets are located in a couple of places in the lower section of Whytecliff Park. The first set it at the far end of the main parking lot and the second is at the bottom of a paved pathway next to the beach. There are no toilets located along the upper trails of the park.",
    "transit": "Yes"
  }
]